<template>
  <q-dialog :model-value="checkToggle" @hide="emit('close_policy',false)">
    <q-card style="min-width:80%">
      <q-card-section>
        <div class="text-h2">Политика конфиденциальности</div>
      </q-card-section>
      <q-separator/>
      <q-card-section class="scroll">
        <h2>1. Общие положения</h2>
        <p>1.1. Данный документы является официальным публичным предложением Общества с ограниченной ответственностью
          «ИНЖЕНЕРНАЯ СЛУЖБА», в лице Генерального директора Мурашова Александра Александровича, действующего на
          основании Устава, именуемого в дальнейшем «Исполнитель», в адрес неопределенного круга лиц, именуемых в
          дальнейшем «Заказчик», заключить договор предоставления услуг дистанционным способом (далее по тексту
          «Договор») на условиях, содержащихся в настоящей Оферте.</p>
        <p>1.2. Настоящее предложением в соответствии с п. 2 ст. 437 Гражданского Кодекса Российской Федерации является
          Публичной офертой (далее по тексту «Оферта»), полным и безоговорочным принятием («Акцептом») условий которых,
          в соответствии со ст. 438 Гражданского кодекса Российской Федерации, считается осуществление Покупателем
          определенных конклюдентных действий, указанных в настоящем Договоре.</p>
        <p>1.3. Оферта может быть акцептована (принята) любым физическим или юридическим лицом на территории Российской
          Федерации и стран СНГ, имеющим намерение приобрести услуги, предоставляемые Заказчиком через сайт,
          расположенный по адресу: is-mos.ru</p>
        <p>1.4. Настоящая публичная оферта определяет все существенные условия договора между «Исполнителем» и лицом,
          акцептовавшим настоящую Оферту.</p>
        <p>1.5. Заказчик безоговорочно принимает все условия, содержащиеся в оферте в целом (т.е. в полном объеме и без
          исключений).</p>
        <p>1.6. Акцептом является подписание Акта выполненных работ (оказанных услуг) по окончанию проведения работ
          (предоставления услуг), принятых Заказчиком и/или путем нажатия на кнопку «ОФОРМИТЬ ЗАКАЗ» расположенную на
          сайте: is-mos.ru</p>
        <p>1.7. Настоящий Договор заключается между Заказчиком и Исполнителем в момент оформления заказа в размере и на
          условиях настоящего Договора.</p>
        <p>1.8. В случае принятия условий настоящего Договора (т.е. публичной оферты) лицо, производящее акцепт оферты,
          становится Заказчиком.</p>
        <p>1.9. Оферта, все приложения к ней, а также вся дополнительная информация о услугах ООО «ИНЖЕНЕРНАЯ СЛУЖБА»,
          опубликована на сайте is-mos.ru</p>
        <h2>2. Определения</h2>
        <p>2.1. Оферта — настоящий документ Публичная Оферта на осуществление сделки предоставления услуг, по которому
          одна сторона (Исполнитель) обязуется предоставить услуги другой стороне (Заказчику), а Заказчик обязуется
          принять эти услуги и уплатить за них определенную денежную сумму.</p>
        <p>2.2. Акцепт Оферты — полное и безвозвратное принятие Оферты методом выполнения действий, указанных в п. 5.3
          данной Оферты. Акцепт Оферты предполагает Договор Оферты.</p>
        <p>2.3. Договор Оферты — договор услуг, заключенный между Исполнителем и Заказчиком путем акцепта настоящего
          соглашения.</p>
        <p>2.4. Заказчик - физическое или юридическое лицо, принявшее в полном объеме и без исключений условия оферты
          (совершившее акцепт оферты) в соответствии с п. 5.3. оферты.</p>
        <p>2.5. Исполнитель – Общества с ограниченной ответственностью «ИНЖЕНЕРНАЯ СЛУЖБА».</p>
        <p>2.6. Сайт - интернет-сайт, имеющий адрес в сети интернет: по адресу is-mos.ru принадлежащий Исполнителю и
          предназначенный для продажи (предоставления) Исполнителем Заказчику на основании оферты услуг (работ),
          выполняемые Исполнителем.</p>
        <p>2.7. Прайс – информация о услугах (работах), размещенная на сайте is-mos.ru</p>
        <p>2.8. Заказ - решение Заказчика приобрести услугу(работу), оформленную на сайте.</p>
        <p>2.9. Место исполнения договора - место (адрес), указанное Заказчиком, по которому предоставляются услуги
          Заказчику силами Исполнителя.</p>
        <p>2.10. Представитель – физическое лицо, предъявившее квитанцию или иной документ, свидетельствующий о
          заключении договора. Представитель юридического лица кроме вышеуказанных документов обязан предъявить
          доверенность на получение товара и паспорт.</p>
        <p>2.11. Стороны – совместно именуемые Исполнитель и Заказчик.</p>
        <h2>3. Статус сайта</h2>
        <p>3.1. Сайт (is-mos.ru) является собственностью ООО «ИНЖЕНЕРНАЯ СЛУЖБА» и предназначен для организации
          дистанционного способа продажи услуг через сеть интернет. 3.2. ООО «ИНЖЕНЕРНАЯ СЛУЖБА» не несет
          ответственности за содержание и достоверность информации, предоставленной Заказчиком при оформлении
          заказа.</p>
        <h2>4. Статус заказчика</h2>
        <p>4.1. Заказчик несет ответственность за достоверность предоставленной при оформлении заказа информации и ее
          чистоту от претензий третьих лиц.</p>
        <p>4.2. Заказчик подтверждает свое согласие с условиями, установленными настоящим Договором, путем проставления
          отметки в графе «Условия Договора мною прочитаны полностью, все условия Договора мне понятны, со всеми
          условиями Договора я согласен» при оформлении заказа через сайт is-mos.ru и/или путем проставления подписи под
          Актом выполненных работ (предоставленных услуг) представленном на бумажном носителе.</p>
        <p>4.3. Использование ресурса сайта для просмотра и выбора услуг, а также для оформления заказа является для
          Заказчика безвозмездным.</p>
        <h2>5. Предмет оферты</h2>
        <p>5.1. Исполнитель, на основании заказов Заказчика и на основании предварительной оплаты, предоставляет
          Заказчику услуги в соответствии с условиями и по ценам, установленным Исполнителем в оферте и приложениях к
          ней.</p>
        <p>5.2. Предоставление работ (услуг), заказанных и оплаченных Заказчиком, осуществляется
          высококвалифицированными специалистами. Заказчику при оформлении заказа предоставляется право выбора времени
          оказания работ (услуг).</p>
        <p>5.3. Физическое или юридическое лицо считается принявшим все условия оферты (акцепт оферты) и приложений к
          ней в полном объеме и без исключений с момента Нажатие на кнопку «ОФОРМИТЬ ЗАКАЗ» на сайте: is-mos.ru и/или
          путем проставления подписи под Актом выполненных работ (предоставленных услуг) представленном на бумажном
          носителе.</p>
        <p>5.4. В случае акцепта оферты вышеуказанным способом, физическое лицо и/или юридическое считается заключившим
          с Исполнителем договор услуг и приобретает статус Заказчика.</p>
        <h2>6. Порядок заключения договора</h2>
        <p>6.1. Заказчик может оформить заказ самостоятельно на сайте is-mos.ru, или по телефону 8 (495) 201 00 14 на
          условиях Договора (публичной оферты).</p>
        <p>6.2. При оформлении заказа на сайте и /или по телефону, Заказчик обязан предоставить о себе информацию.</p>
        <ul class="list">
          <li>Ф.И.О. (для физических лиц) или полное наименование, ИНН (для юридических лиц) Заказчика услуг;</li>
          <li>адрес предоставления услуг.</li>
          <li>контактный телефон и электронную почту Заказчика услуг.</li>
        </ul>
        <p>6.3. Волеизъявление Заказчика осуществляется посредством нажатия на кнопку «ОФОРМИТЬ ЗАКАЗ» на сайте:
          is-mos.ru и/или подписанием Акта выполненных работ (оказанных услуг) на бумажном носителе.</p>
        <p>6.4. Сайт не редактирует информацию о Заказчике.</p>
        <p>6.5. Для получения бумажного экземпляра Договора услуг в случае оформления заказа через кнопку «ОФОРМИТЬ
          ЗАКАЗ» на сайте: is-mos.ru Заказчик отправляет заявку по электронной почте, указанной на сайте.</p>
        <h2>7. Информация об услугах</h2>
        <p>7.1. Услуги представлены на сайте через фото-образцы, являющиеся собственностью сайта.</p>
        <p>7.2. Каждый фото-образец сопровождается текстовой информацией.</p>
        <p>7.3. Все информационные материалы, представленные на сайте, носят справочный характер и не могут в полной
          мере передавать информацию о свойствах и характеристиках услуг. В случае возникновения у Заказчика вопросов,
          касающихся характеристик предлагаемых услуг, Заказчик должен, перед оформлением заказа, обратиться к
          Исполнителю по телефонам, указанным на сайте.</p>
        <p>7.4. По просьбе Заказчика менеджер обязан предоставить (по телефону или посредством электронной почты) прочую
          информацию, необходимую и достаточную, с точки зрения Заказчика, для принятия им решения о заказе услуг.</p>
        <h2>8. Порядок приобретения услуг</h2>
        <p>8.1. Заказчик вправе оформить заказ на любую услугу, представленную на сайте. Каждая услуга может быть
          заказана в любом количестве.</p>
        <p>8.2. После оформления заказа Исполнитель на e-mail Заказчика отправляет подтверждение принятия заказа и счет,
          с указанием наименования, цены заказанных услуг и общей суммы заказа, являющийся неотъемлемой частью
          настоящего договора. Оплата счета Заказчиком является подтверждением оформленного заказа. Далее менеджер
          связывается с Заказчиком (по телефону или посредством электронной почты) для уточнения информации по заказу и
          срокам его исполнения.</p>
        <p>8.3. При невозможности оказать услуги в назначенное время менеджер обязан поставить в известность об этом
          Заказчика (по телефону или посредством электронной почты).</p>
        <p>8.4. Заказ обрабатывается только после подтверждения заказа менеджеру по телефону или посредством электронной
          почты.</p>
        <h2>9. Цена услуг</h2>
        <p>9.1. Цена услуг на сайте указана в рублях РФ.</p>
        <p>9.2. Указанная на сайте цена услуг может быть изменена в одностороннем порядке, при этом цена на заказанную и
          оплаченную услугу Заказчиком изменению не подлежит.</p>
        <p>9.3. Стоимость услуг, предоставляемых Заказчику Исполнителем при заказе услуг на сайте указана в разделе
          «стоимость услуг»</p>
        <h2>10. Оплата услуг</h2>
        <p>10.1. Способы и порядок оплаты услуг указаны на сайте в разделе «оплата». При необходимости порядок и условия
          оплаты услуг оговариваются Заказчиком с менеджером.</p>
        <p>10.2. Счет на оплату услуг действителен в течении 5 (пяти) дней с момента оформления заказа и подтверждения у
          Менеджера.</p>
        <p>10.3. Заказчик оплачивает заказ услуг любым способом, выбранным на сайте.</p>
        <p>10.4. Обязанность Заказчика по оплате услуг считается исполненной с момента зачисления соответствующих
          денежных средств на расчетный счет Исполнителя. Физическое или юридическое лицо считается оплатившим услугу с
          момента поступления денежных средств в счет оплаты услуг на расчётный счёт Исполнителя (в случае безналичной
          оплаты), либо с момента поступления денежных средств в счет оплаты услуг на расчетный счет Оператора платежной
          системы (в случае оплаты через платежные системы), либо внесения денежных средств в кассу Исполнителя в
          порядке и на условиях, установленных Исполнителем.</p>
        <p>10.5. После поступления денежных средств на счет Исполнителя, менеджер согласовывает с Заказчиком срок
          исполнения услуг.</p>
        <p>10.6. Расчеты Сторон при оплате заказа осуществляются в российских рублях.</p>
        <h2>11. Предоставление услуг</h2>
        <p>11.1. Способы, порядок и сроки предоставления услуг указаны на сайте в разделе «предоставление услуг», либо
          согласовываются отдельно с менеджером по телефону</p>
        <p>11.2. Предоставление услуг Исполнителем:</p>
        <p>11.2.1. Работы (услуги) считаются оказанными при совершении определенных действий или при осуществлении
          определенной деятельности по заданию Заказчика. Работы (услуги) предоставляются при предъявлении документа,
          удостоверяющего личность, надлежащим образом оформленной доверенности, содержащей подпись и печать, а при
          необходимости иных документов, подтверждающих полномочия Заказчика. Заказчик уведомлен и согласен, что
          Исполнитель не производит юридическую экспертизу подлинности подписей и печатей, содержащихся в доверенностях
          представителей Исполнителя, а также не требует нотариально удостоверенную доверенность для подтверждения
          полномочий Исполнителя, в случаях предусмотренных частью 2 ст. 312 Гражданского кодекса РФ. Исполнитель не
          несет ответственности за последствия предоставления работ (услуг) неуполномоченному лицу в тех случаях, когда
          Исполнитель не мог установить факта оказания работ (услуг) неуполномоченному лицу при обычном осмотре
          документов, предъявляемых представителем Заказчиком.</p>
        <p>11.2.2. Факт оказания работ (услуг) Заказчику подтверждается актом приемки работ (услуг).</p>
        <p>11.2.3. Заказчик обязан принять работы (услуги) в момент оказания работ (услуг).</p>
        <p>11.3. При завершении оказания работ (услуг) Заказчик должен в присутствии представителя Исполнителя проверить
          соответствие оказанных работ (услуг), удостовериться в качестве предоставленных работ (услуг).</p>
        <p>11.4. Заказчик или Представитель заказчика при приемке оказанных работ (услуг) подтверждает своей подписью в
          акте, что не имеет претензий к оказанным работам (услугам).</p>
        <p>11.5. Если Заказчик откажется от исполнения Договора полностью или частично до оказания работ (услуг),
          Заказчик обязан возместить Исполнителю прямые и/или косвенные убытки, вызванные действием и/или бездействием
          Исполнителя.</p>
        <h2>12. Гарантии на услуги</h2>
        <p>12.1. Работы (услуги), перечень которых представлен на сайте is-mos.ru обладает необходимыми аттестатами,
          свидетельствами, российского и/или европейского образца.</p>
        <h2>13. Ответственность сторон</h2>
        <p>13.1. Стороны несут ответственность в соответствии с законодательством РФ.</p>
        <p>13.2. Исполнитель не несет ответственности за ущерб, причиненный Заказчику вследствие неосторожных или
          виновных действий со стороны Заказчика и третьих лиц в отношении оказанных работ (услуг).</p>
        <p>13.3. Стороны освобождаются от ответственности за неисполнение или ненадлежащее исполнение обязательств по
          договору на время действия непреодолимой силы.</p>
        <h2>14. Прочие условия</h2>
        <p>14.1. К отношениям между Заказчиком и Исполнителем применяется законодательство Российской Федерации.</p>
        <p>14.2. При необходимости Исполнитель и Заказчик вправе в любое время оформить договор работ (услуг) в форме
          письменного двухстороннего соглашения, не противоречащего положениям настоящей оферты.</p>
        <p>14.3. В случае возникновения вопросов и претензий со стороны Заказчика, он должен обратиться к Исполнителю по
          реквизитам, указанным на сайте is-mos.ru</p>
        <p>14.4. Настоящий договор вступает в силу с даты акцепта Заказчика настоящей оферты и действует до полного
          исполнения обязательств Сторонами.</p>
        <p>14.5. Все споры и разногласия, возникающие при исполнении Сторонами обязательств по настоящему договору,
          решаются путем переговоров. В случае невозможности их устранения, Стороны имеют право обратиться за судебной
          защитой своих интересов.</p>
        <p>14.6. «ИНЖЕНЕРНАЯ СЛУЖБА» оставляет за собой право расширять и сокращать предложение на сайте, регулировать
          доступ к заказу любых услуг, изменять стоимость, а также приостанавливать или прекращать предоставление услуг
          по своему собственному усмотрению.</p>
        <h2>15. Адрес и реквизиты исполнителя</h2>
        <p>ООО «Инженерная Служба»<br>ИНН/КПП: 7718948309/771801001<br>ОГРН: 1137746864408<br>р/с:
          40702810410000754447<br>к/с: 30101810145250000974<br>АО "ТИНЬКОФФ БАНК"<br>БИК: 044525974<br>107564, г.
          Москва, Краснобогатырская ул., д. 38 стр. 2, этаж 3, помещ. 9, ком. 7<br>Генеральный директор: Мурашов
          Александр Александрович</p>
      </q-card-section>
      <q-separator/>
      <q-card-actions align="right">
        <q-btn flat label="Accept" color="primary" v-close-popup/>
      </q-card-actions>
    </q-card>
  </q-dialog>
</template>


<script setup>
const props = defineProps({
  checkToggle: {
    type: Boolean,
    required: true,
  }
})
const emit = defineEmits(['close_policy'])
</script>


<style scoped>

</style>
